music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "belgic@email.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(user_params)
    user = User.find_by(email: user_params[:email])

UPDATE "users" SET "session_token" = $1, "activation_token" = $2 WHERE "users"."id" = $3  [["session_token", "wLgXPWFLxIMkfO-HyPKfXQ"], ["activation_token", "Xbv6kQroXlaW-UQzkx0faQ"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = User.generate_token
    self.save