polls_app/app/models/response.rb

SELECT "responses".* FROM "responses" WHERE "responses"."question_id" = $1 AND "responses"."id" IS NOT NULL  [["question_id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def sibling_responses
    self.question.responses.where.not(id: self.id)