cats/app/controllers/cat_rental_requests_controller.rb

  def new
    @cr = CatRentalRequest.new
    @cats = Cat.all.select(:name, :id)
---
SELECT "cats"."name", "cats"."id" FROM "cats"

  def create
    @cr = CatRentalRequest.new(cr_params)

    if @cr.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2022-01-24"], ["end_date", "2022-01-28"], ["created_at", "2022-01-19 10:36:54.746308"], ["updated_at", "2022-01-19 10:36:54.746308"]]

  def approve
    @cr = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def deny
    @cr = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]