music_app/app/views/albums/_album_form.html.erb

            <option value="" hidden>--Please Select--</option>
            <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"