music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @album = Album.new
    @band = Band.find_by(id: params[:band_id])

INSERT INTO "albums" ("title", "year", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Wasdhjh"], ["year", 2022], ["artist_id", 1]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "studio" = $1 WHERE "albums"."id" = $2  [["studio", false], ["id", 1]]
---
  def update
    @album = Album.find_by(id: params[:id])

    if @album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 5]]
---
  def destroy
    @album = Album.find_by(id: params[:id])

    if @album.destroy