music_app/app/controllers/bands_controller.rb

  def index
    @bands = Band.all.order(:name)
---
SELECT "bands".* FROM "bands" ORDER BY "bands"."name" ASC

  def update
    @band = Band.find_by(id: params[:id])

    if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "System of a Down2"], ["updated_at", "2022-01-26 10:54:07.329759"], ["id", 1]]

  def destroy
    @band = Band.find_by(id: params[:id])

    if @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 6]]