music_app/app/controllers/notes_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "notes" ("body", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sddfsdsfdsdf          "], ["user_id", 1], ["track_id", 13], ["created_at", "2022-01-26 19:08:27.206680"], ["updated_at", "2022-01-26 19:08:27.206680"]]
---
  def create
    @note = Note.new(note_params)
    @track = Track.find_by(id: params[:track_id])

    @note.track_id = @track.id
    @note.user_id = current_user.id

    if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 5]]
---
  def destroy
    @note = Note.find_by(id: params[:id])
    @track = @note.track

    if @note.destroy

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def require_note_owner!
    @note = Note.find_by(id: params[:id])