music_app/app/controllers/tracks_controller.rb

  def show
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def new
    @track = Track.new
    @album = Album.find_by(id: params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @track = Track.new(track_params)

    if @track.save
---
INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "The weirder it gets"], ["ord", 1], ["lyrics", "          La di da  \r\n          "], ["album_id", 15]]

  def edit
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

  def update
    @track = Track.find_by(id: params[:id])

    if @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1 WHERE "tracks"."id" = $2  [["lyrics", "This and that"], ["id", 14]]

  def destroy
    @track = Track.find_by(id: params[:id])

    if @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 14]]