cats/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2022-01-19 12:19:56.097322"], ["id", 8]]
---
  def approve!
    CatRentalRequest.transaction do
      self.status = "APPROVED"
      self.overlapping_pending_requests.each { |request| request.deny! }
      self.save

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2022-01-19 12:24:36.079225"], ["id", 8]]
---
  def deny!
    self.status = "DENIED"
    self.save