05_activerecord_urlshortener/URLShortener/app/models/shortened_url.rb

SELECT  "shortened_urls".* FROM "shortened_urls" ORDER BY "shortened_urls"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def no_spamming
    # cannot submit more than 5 URLs in a single minute
    record = self.submitter.submitted_urls.last(5)

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "https://www.prb01.com/NiYK1awpSXqE23uuDMuTsw"], ["LIMIT", 1]]
---
  def self.random_code
    url = nil
    while !url || ShortenedUrl.exists?(short_url: url)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def self.create!(user, long_url)

SELECT "visits".* FROM "visits" WHERE "visits"."url_id" = $1  [["url_id", 64]]
SELECT "shortened_urls".* FROM "shortened_urls" INNER JOIN "users" ON "users"."id" = "shortened_urls"."user_id" LEFT OUTER JOIN "visits" ON "visits"."url_id" = "shortened_urls"."id" WHERE (users.premium = false) GROUP BY "shortened_urls"."id" HAVING (MAX(visits.created_at) <= '2021-12-30 08:13:51.903866' OR MAX(visits.created_at) IS NULL)
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 16]]
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 61]]
---
  def self.prune(n)
    prune_urls = ShortenedUrl.joins(:submitter).left_joins(:visits).where("users.premium = false").group(:id).having("MAX(visits.created_at) <= ? OR MAX(visits.created_at) IS NULL", n.minutes.ago)
    prune_urls.each do |url|
      url.visits.destroy_all
      url.taggings.destroy_all
    end
    prune_urls.destroy_all