cats/app/views/cats/_rentals.html.erb

  </tr>
  <% cat.rental_requests.each do |rental| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 1]]