URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "https://www.prb01.com/04AqOGS2uHFuQJT4rXBMCA"], ["LIMIT", 1]]
---
  def self.random_code
    url = nil
    while !url || ShortenedUrl.exists?(short_url: url)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "f"], ["short_url", "https://www.prb01.com/Kx1t2dCH7LipLF2tXc7sKg"], ["user_id", 3], ["created_at", "2021-12-29 15:23:31.779096"], ["updated_at", "2021-12-29 15:23:31.779096"]]
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def self.create!(user, long_url)
    ShortenedUrl.create(long_url: long_url,
      short_url: ShortenedUrl.random_code,
      user_id: user.id)