URLShortener/app/models/visit.rb

  def self.record_visit!(user, shortened_url)
    Visit.create(url_id: shortened_url.id, user_id: user.id)
---
INSERT INTO "visits" ("url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url_id", 11], ["user_id", 3], ["created_at", "2021-12-29 15:44:13.306643"], ["updated_at", "2021-12-29 15:44:13.306643"]]